import { DataT } from "../../types";
import IMAGE_01 from "../images/dog1.jpg";
import IMAGE_02 from "../images/dog2.jpg";
import IMAGE_03 from "../images/dog3.jpg";
import IMAGE_04 from "../images/dog4.jpg";
import IMAGE_05 from "../images/dog5.jpg";
import IMAGE_06 from "../images/dog6.jpg";
import IMAGE_07 from "../images/dog7.jpg";
import IMAGE_08 from "../images/dog8.jpg";
import IMAGE_09 from "../images/dog9.jpg";
import IMAGE_10 from "../images/dog10.jpg";

const data: DataT[] = [
  {
    id: 1,
    name: "EIMI FUKADA",
    isOnline: true,
    match: "100",
    description:
      "big big boob.",
    message:
      "I will go back to Gotham and I will fight men Iike this but I will not become an executioner.",
    image: IMAGE_01,
  },
  {
    id: 2,
    name: "น้องโกโก้",
    match: "93",
    description:
      "ร่าเริง ขี้เล่น สุขภาพแข็งแรง รอดจากการเป็นอาหารของงูหลาม ตัวเงินตัวทอง  รอดจากการถูกรถชน.",
    isOnline: false,
    message: "Someone like you. Someone who'll rattle the cages.",
    image: IMAGE_02,
  },
  {
    id: 3,
    name: "มิเชล",
    match: "45",
    description:
      "มิเชล ที่กลายเป็นหมาไร้บ้าน  ไร้ที่พักพิง แม้อีกไม่กี่วันจะสิ้นเดือน แต่ทีคอกวัดแน่นขนัดเต็มไปด้วยลูกหมาหนีตาย  มิเชลไม่มีที่ไป  ขอชีวิตและโอกาสให้หมาไทยเจียมเนื้อเจียมตัว",
    isOnline: false,
    message:
      "Oh, hee-hee, aha. Ha, ooh, hee, ha-ha, ha-ha. And I thought my jokes were bad.",
    image: IMAGE_03,
  },
  {
    id: 4,
    name: "บิ๊ก",
    match: "88",
    description:
      "รักเคยพัดผ่านมา แล้วลับลาดั่งลม ทิ้งเพียงความขื่นขมอยู่ในใจ เฝ้ารอใครสักคน เมื่อสายลมพัดมาใกล้ อาจเจอใครสักคนที่ไม่ผ่านเลย ให้บิ๊กหน่อยได้ไหม",
    isOnline: true,
    message: "Bats frighten me. It's time my enemies shared my dread.",
    image: IMAGE_04,
  },
  {
    id: 5,
    name: "ลูก้า",
    match: "76",
    description:
      "ลูก้าเป็นหมาหลงที่เดินหาอาหารไปทั่ว อดมื้อกินมื้อและคอยหลบเจ้าถิ่นมาตลอด วันนึงถูกคนเอาไม้ตีจนกรามหัก",
    isOnline: false,
    message: "It's not who I am underneath but what I do that defines me.",
    image: IMAGE_05,
  },
  {
    id: 6,
    name: "ปีโป้",
    match: "95",
    description:
      "ถูกช่วยมาจากกรณีที่เจ้าของถูกฆ่าข่มขืน น้องๆอยู่ตามลำพังหลายวันกว่าจะมีคนไปพบก็ทนหิวและอยู่ในสภาพที่ย่ำแย่ เป็นโศกนาฏกรรมที่ร้ายแรงมากสำหรับหมาที่อยู่ๆวันนึงก็ต้องกลายเป็นหมาไร้บ้านเพราะคนเลวคนนึง",
    isOnline: true,
    message:
      "You have nothing, nothing to threaten me with. Nothing to do with all your strength.",
    image: IMAGE_06,
  },
  {
    id: 7,
    name: "SIMBA",
    match: "67",
    description:
      "น้อง SIMBA อายุ 7 ขวบ น้ำหนักประมาณ 28 กิโลกรัม พันธุ์เทอร์เรียร์ขนาดใหญ่ที่มีนิสัยขี้เล่นและเป็นมิตรกับมนุษย์และสุนัขตัวอื่นๆ ",
    isOnline: true,
    message:
      "Never start with the head. The victim gets all fuzzy. He can't feel the next... See?",
    image: IMAGE_07,
  },
  {
    id: 8,
    name: "มีตังค์",
    match: "85",
    description:
      "มีตังค์ จากป่าปิด หลังมบ.ชวนชื่น หนึ่งในผู้รอดชีวิตที่ได้พานพบและได้ช่วยเหลือได้เป็นหมาบ้านที่ได้รับโอกาส",
    age: "27",
    location: "Irvine, CA",
    info1: 'Straight, Single, 5"10',
    info2: "Tea Totaller, Loves Photography & Travel",
    info3: "Beaches, Mountain, Cafe, Movies",
    info4: "Last seen: 23h ago",
    isOnline: true,
    message:
      "And as for the television's so-called plan, Batman has no jurisdiction.",
    image: IMAGE_08,
  },
  {
    id: 9,
    name: "เหลง",
    match: "74",
    description:
      "รอดชีวิต​จากความอดอยากเดิมสภาพ​ผอมแคระแกรน  ได้รับการเตรี​ยมพร้อมอย่างดี​ทุก​อย่างพร้อมหาบ้าน​🏠​  เมตตาให้ทั้งคู่​ไม่ต้องตกค้างเป็นหมาวัด",
    isOnline: true,
    message:
      "This is what happens when an unstoppable force meets an immovable object.",
    image: IMAGE_09,
  },
  {
    id: 10,
    name: "โตโน่",
    match: "98",
    description:
      "เมือไรจะถึงคิวของโตโน่ บ้างค้าบ ในเมื่อทุกชีวิต​มีสิทธิ์​มีบ้าน​ บีเกิ้ลผสมตกยาก รอดชีวิตมาได้ ก็อยากมีชีวิตใหม่ที่สดใสและอบอุ่น",
    isOnline: false,
    message:
      "You want order in Gotham. Batman must take off his mask and turn himself in.",
    image: IMAGE_10,
  },
];

export default data;
